{
  "backend/main.mo": "Empty Motoko actor with no backend logic; the application is entirely frontend-driven with static content.",
  "feature_evidence.json": "Feature evidence report documenting a completed fix to the CompaniesSection component to prevent logo cropping by adjusting container dimensions and object-fit properties.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing the homepage layout, hero section, services, companies logos display, contact form, footer, and styling configurations.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system variables for light and dark themes, defining navy, gold, accent-blue, and slate color palettes for the insurance website theme.",
  "frontend/index.html": "HTML entry point with meta tags, title, and root div for mounting the React application with a redeployment trigger comment.",
  "frontend/src/App.tsx": "Main application component orchestrating the homepage layout with hero, services, child benefits, companies, contact sections, footer, and decorative section dividers between major sections.",
  "frontend/src/components/ChildBenefitsSection.tsx": "Informational section highlighting benefits of child life insurance policies, featuring tax-free wealth building and compounded interest growth with decorative icons and gradient navy background.",
  "frontend/src/components/CompaniesSection.tsx": "Displays five A+ rated insurance carrier logos with fixed 200px height containers and object-contain styling to prevent cropping, plus a \"+25 other carriers\" card and explanation of independent broker advantages.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with fields for first/last name, state dropdown, product interest, coverage amount, age, gender radio buttons, and additional comments textarea with form submission handling.",
  "frontend/src/components/Footer.tsx": "Footer component with gradient navy background displaying company information, contact details, services list, copyright notice, and caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/HeroSection.tsx": "Hero section component displaying Jonathan Ayan's name, title, professional headshot, and call-to-action buttons over a Miami skyline background with gradient overlay.",
  "frontend/src/components/ServicesSection.tsx": "Services section component showcasing two main offerings (Life Insurance and Annuities) in card layouts with icons, descriptions, and feature lists.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor instance, handling both authenticated and anonymous states with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend query methods are needed since all content is static.",
  "frontend/src/index.css": "Tailwind CSS configuration defining a professional insurance theme with navy, gold, and accent-blue color schemes in both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom insurance brand colors (navy, gold, accent-blue), container settings, and additional shadow/animation utilities.",
  "project_state.json": "Project state tracking file for Jonathan Ayan's insurance broker website, documenting 27 versions of development with architectural notes, known issues (contact form missing, logo display problems), and existing features. Contains metadata about the single-page professional website showcasing broker credentials, services, A+ rated insurance carriers, and contact information for all 50 states licensing."
}