{
  "backend/main.mo": "Main actor defining user profiles, contact form submissions with guest access, and admin panel endpoints protected by role-based access control using MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: comprehensive error logging in ContactSection form submission, error handling in useSubmitContactForm mutation hook, and form field validation with default values for bestTimeToContact and bestDayToContact.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including components, hooks, pages, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with meta tags, title for Jonathan Ayan Insurance Broker Website, and root div for React application mounting.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with homepage and admin panel routes, wrapped in QueryClientProvider for React Query state management.",
  "frontend/src/components/ChildBenefitsSection.tsx": "Section component explaining benefits of child life insurance policies, highlighting tax-free wealth building and compounded interest growth with navy gradient background and decorative elements.",
  "frontend/src/components/CompaniesSection.tsx": "Section displaying five A+ rated insurance carrier logos (Mutual of Omaha, Transamerica, Ethos, Fidelity and Guaranteed Life, Foresters) plus a '+25 other carriers' card with explanatory text about independent broker advantages.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with validation for insurance inquiries, collecting user details (name, state, age, gender, product interest, coverage amount) and preferred contact times. Integrates with backend submission hook and displays success/error alerts.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company information (Equity Insurance Partners), contact details, services list, and copyright notice with admin link and caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Hero section featuring Jonathan Ayan's professional profile with background image, headshot, call-to-action buttons, and description of services (Life & Annuity Insurance Broker serving all 50 states).",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity, handles authentication flow, and clears query cache on logout.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying two main offerings (Life Insurance and Annuities) in card format with icons, descriptions, and feature lists for each service type.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing with anonymous or authenticated identity and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity state, and authentication status with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile management, admin checks, and contact form submission. Includes detailed logging for the contact form mutation and maps frontend data types to backend enums (Gender, ProductInterest).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for an insurance-themed UI using navy, gold, and accent blue colors in OKLCH color space. Includes light/dark mode support and custom utility classes for brand colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page component that displays contact form submissions in a table, handles user authentication via Internet Identity, and includes profile setup dialog for first-time users. Shows login prompt for unauthenticated users and checks admin permissions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to store, retrieve, and clear parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (navy, gold, accent-blue, slate) using OKLCH color space, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for Jonathan Ayan's insurance broker website, documenting 49 versions of development including features, known issues (admin login and contact form errors), and architectural notes. Contains metadata about the single-page professional website showcasing broker credentials, services, A+ rated carriers, and contact information for all 50 states licensing."
}