{
  "backend/main.mo": "Main actor implementing user profile management and contact form submission functionality with role-based access control using MixinAuthorization; includes admin-only endpoints for viewing submissions and user-only endpoints for profile management.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files including components, hooks, pages, and configuration files for an insurance broker website with admin panel and Internet Identity authentication.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space, including navy, gold, accent-blue, and slate color tokens.",
  "frontend/index.html": "HTML entry point for the React application with basic meta tags, title for Jonathan Ayan Insurance Broker Website, and root div mounting point.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with homepage and admin panel routes, wrapped in QueryClientProvider; homepage includes hero, services, child benefits, companies, contact sections with decorative dividers.",
  "frontend/src/components/ChildBenefitsSection.tsx": "Section component explaining child life insurance benefits with two feature cards highlighting tax-free wealth building and compounded interest growth, styled with navy gradient background and decorative elements.",
  "frontend/src/components/CompaniesSection.tsx": "Section displaying five A+ rated insurance carrier logos (Mutual of Omaha, Transamerica, Ethos, Fidelity and Guaranteed Life, Foresters) plus a '+25 other carriers' card, with explanatory text about independent broker advantages.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with validation for insurance inquiries, collecting user details (name, state, age, gender, product interest, coverage amount, contact preferences) and submitting via useSubmitContactForm hook. Includes success/error alerts and form state management.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company information (Equity Insurance Partners, Jonathan Ayan), contact details, services list, copyright notice, caffeine.ai attribution, and admin link. Uses gradient navy background with gold accents.",
  "frontend/src/components/HeroSection.tsx": "Hero section with Miami skyline background image, featuring Jonathan Ayan's name, title (Life & Annuity Insurance Broker), professional headshot, and call-to-action buttons that scroll to contact section.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity, handling login/logout with query client cache clearing and error recovery for already-authenticated state.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying two cards for Life Insurance and Annuities with icons, descriptions, and feature lists. Uses gradient background with decorative pattern overlay.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity persistence, and authentication status states (initializing, idle, logging-in, success, error).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile management, admin checks, and contact form submission with extensive logging and type mapping between frontend and backend enums.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom insurance-themed color variables (navy, gold, accent-blue, slate) for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page component that checks authentication and admin status, displays contact form submissions in a table, and handles user profile setup with principal ID copying functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom insurance brand colors (navy, gold, accent-blue, slate) using OKLCH color space and custom shadow/radius utilities.",
  "project_state.json": "Project metadata indicating an Insurance Broker Portal with a known issue where admin access fails in production after publishing, and pending feature requests to fix Principal ID whitelist configuration and persistence."
}