{
  "backend/main.mo": "Main actor implementing user profiles, contact form submissions, and admin panel with role-based access control using AccessControl and MixinAuthorization modules; includes migration support and defines types for UserProfile, ContactFormSubmission, ProductInterest, and Gender.",
  "backend/migration.mo": "Migration module that transforms OldActor state (with admins list) to NewActor state (without admins), preserving userProfiles and submissions data structures.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 15 frontend files including React components, hooks, configuration, and pages for an insurance broker website with Internet Identity authentication and admin panel.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space, including navy, gold, accent-blue, and slate colors for an insurance-themed design system.",
  "frontend/index.html": "HTML entry point with meta tags, title for Jonathan Ayan Insurance Broker Website, root div, and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React app with TanStack Router configuration defining homepage (with hero, services, child benefits, companies, contact sections) and admin panel routes, wrapped in QueryClientProvider.",
  "frontend/src/components/ChildBenefitsSection.tsx": "Section component explaining benefits of child life insurance policies with two feature cards highlighting tax-free wealth building and compounded interest growth, styled with navy gradient background and decorative elements.",
  "frontend/src/components/CompaniesSection.tsx": "Section displaying five A+ rated insurance carrier logos (Mutual of Omaha, Transamerica, Ethos, Fidelity and Guaranteed Life, Foresters) plus a \"+25 other carriers\" card, with explanatory text about independent broker advantages.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with validation for insurance inquiries, collecting user details (name, state, age, gender, product interest, coverage amount) and preferred contact time/day. Handles form submission via useSubmitContactForm hook with success/error states.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company information (Equity Insurance Partners, Jonathan Ayan), contact details, services list, copyright notice, and links to admin page and caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, professional headshot, main heading for Jonathan Ayan as Life & Annuity Insurance Broker, and call-to-action buttons that scroll to contact section.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity that toggles between login/logout states, handles authentication flow, and clears query cache on logout.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying two main offerings (Life Insurance and Annuities) in card format with icons, descriptions, and feature lists for each service type.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flow, identity state, and authentication status with configurable options for idle handling and identity provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile management, admin authorization checks, and contact form submission with actor-based backend communication and query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a professional insurance theme featuring navy blue, gold accents, and light/dark mode support using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page component that checks user authentication and admin status, displays contact form submissions in a table, and handles user profile setup with Principal ID display.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom color palette (navy, gold, accent-blue, slate) using OKLCH color space and custom border radius/shadow utilities.",
  "project_state.json": "Project metadata tracking an admin authorization bug where Principal ID '5xjc2-y22qo-6hyhb-cz5mg-dskju-ngytr-slbw7-lwush-4ucbp-glcln-s' is not recognized as admin in production and loses access after canister upgrades."
}