{
  "backend/main.mo": "Main actor implementing user profile management, contact form submissions, and admin panel functionality with role-based access control using AccessControl and MixinAuthorization modules.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend components including routing, hero section, services, companies, contact form, admin panel, and hooks for backend integration with Internet Identity authentication.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining color schemes, spacing, and design tokens for light and dark modes using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the React application with meta tags, title, and script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with homepage and admin routes, wrapping the app with QueryClientProvider for React Query state management.",
  "frontend/src/components/ChildBenefitsSection.tsx": "Section component highlighting benefits of child life insurance policies including tax-free wealth building and compounded interest growth with decorative styling.",
  "frontend/src/components/CompaniesSection.tsx": "Section displaying logos of five A+ rated insurance carriers plus a '+25 other carriers' card, with explanatory text about independent broker advantages.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with validation for insurance inquiries, collecting user details (name, state, age, gender, product interest, coverage amount) and preferred contact time/day, with success/error handling and form submission via useSubmitContactForm hook.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company information (Equity Insurance Partners, Jonathan Ayan), contact details, services list, copyright notice, caffeine.ai attribution, and admin link.",
  "frontend/src/components/HeroSection.tsx": "Hero section with Miami skyline background, featuring Jonathan Ayan's professional headshot, title as Life & Annuity Insurance Broker, and call-to-action buttons to scroll to contact form.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity, with loading states and query cache clearing on logout.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying two cards for Life Insurance and Annuities with icons, descriptions, and feature lists, styled with gradient backgrounds and hover effects.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity state, and login status with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, and contact form submissions, using the actor from useActor and Internet Identity for authentication state management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a professional insurance theme using navy blue, gold accents, and slate colors in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page that displays contact form submissions in a table, requires Internet Identity authentication and admin role verification, and includes profile setup flow.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both standard query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom color palette (navy, gold, accent-blue, slate) using OKLCH color space and custom border radius variables.",
  "project_state.json": "Project metadata tracking feature requests to change the website URL from draft deployment to a custom production domain."
}