{
  "backend/main.mo": "Main Motoko actor implementing user profiles, contact form submissions with bestTimeToContact and bestDayToContact fields (both Text type), and admin panel access with role-based authorization using AccessControl and MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting four features for replacing bestTimeToContact with hour selector and bestDayToContact with day-of-month input across ContactSection, useQueries hook, and AdminPanel components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing ContactSection with hour selector (12:00 AM - 11:00 PM) and day-of-month dropdown (1-31), useQueries hook formatting both fields as strings, and AdminPanel displaying them in readable format.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining navy, gold, accent-blue, and slate palettes for light and dark themes with custom CSS variables.",
  "frontend/index.html": "HTML entry point with meta tags, title for Jonathan Ayan Insurance Broker Website, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app with TanStack Router configuring homepage (with HeroSection, ServicesSection, ChildBenefitsSection, CompaniesSection, ContactSection, Footer) and /admin route, wrapped in QueryClientProvider.",
  "frontend/src/components/ChildBenefitsSection.tsx": "Informational section explaining benefits of child life insurance policies with tax-free wealth building and compounded interest protection, styled with navy gradient and gold/accent-blue accents.",
  "frontend/src/components/CompaniesSection.tsx": "Displays a grid of trusted A+ rated insurance carrier logos (Mutual of Omaha, Transamerica, Ethos, etc.) with a card explaining the benefits of choosing an independent broker who can compare multiple carriers.",
  "frontend/src/components/ContactSection.tsx": "Renders a comprehensive contact form with fields for personal info, product interest (life insurance/annuities), coverage amount, demographics, and scheduling preferences, using React Hook Form and a custom mutation hook for submission.",
  "frontend/src/components/Footer.tsx": "Displays company information, contact details, services list, and copyright notice with a link to the admin panel and a caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Hero section featuring Jonathan Ayan's name, title, professional headshot, and call-to-action buttons over a Miami skyline background with gradient overlays.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity, clearing the query cache on logout.",
  "frontend/src/components/ServicesSection.tsx": "Displays two service cards (Life Insurance and Annuities) with icons, descriptions, and bulleted feature lists in a responsive grid layout.",
  "frontend/src/hooks/useActor.ts": "Custom React Query hook that creates and manages a backend actor instance based on Internet Identity authentication state, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication using @dfinity/auth-client. Manages login state, identity persistence, and provides context for authentication status throughout the app.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including user profile management, admin checks, contact form submission, and retrieving all submissions. Maps frontend data types to backend enums (Gender, ProductInterest).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for an insurance-themed UI. Defines color schemes (navy, gold, slate, accent blue) for both light and dark modes with professional styling utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page that displays contact form submissions in a table, requires Internet Identity authentication, and prompts new users to set up a profile. Shows loading states and handles authorization checks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing. Includes sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color palette (navy, gold, accent-blue, slate) using OKLCH color space, container settings, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting a professional insurance broker website for Jonathan Ayan at Equity Insurance Partners, including architectural notes, known issues (admin authentication), and existing features for homepage, services, carriers display, and contact form."
}