{
  "kind": "build_request",
  "title": "Fix admin access in production environment",
  "projectName": "Insurance Broker Portal",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the admin whitelist in the backend's main actor uses the same Principal ID configuration for both draft and production environments so that admin access works consistently after publishing",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Every time I publish it, my published website, I am not allowed in the admin website. I am allowed in the draft website when I go to the admin website, but when I get it published, I am not allowed in."
        ]
      },
      "acceptanceCriteria": [
        "Admin can successfully access the admin panel at /admin in the production environment after publishing",
        "The isAdmin check returns true for the authorized Principal ID in production",
        "Admin access continues to work in draft environment without regression"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify that the admin Principal ID whitelist persists correctly during canister upgrades and is not reset when deploying from draft to production",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "Admin whitelist configuration survives deployment from draft to production",
        "The same Principal ID that works in draft also works in production after publishing",
        "No manual re-configuration is needed after each publish"
      ]
    }
  ],
  "constraints": [
    "Do not change the authentication mechanism (Internet Identity)",
    "Maintain backward compatibility with existing admin authorization flow",
    "Preserve the MixinAuthorization pattern currently in use"
  ],
  "nonGoals": [
    "Adding new admin features or capabilities",
    "Changing the admin panel UI",
    "Modifying the contact form functionality",
    "Adding multi-admin support"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}